app/controllers/pages_controller.rb

  def index
    @timelines = Timeline.all
---
SELECT "timelines".* FROM "timelines"