app/controllers/timeline_controller.rb

INSERT INTO "timelines" ("id_num", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id_num", "1"], ["name", "김형진"], ["content", "안녕"], ["created_at", 2016-12-24 15:43:10 UTC], ["updated_at", 2016-12-24 15:43:10 UTC]]
---
  def create
    if user_signed_in?
      Timeline.create(id_num: current_user.id ,name: current_user.name, content: params[:texts])

INSERT INTO "comments" ("id_num", "timeline_id", "name", "msg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id_num", "2"], ["timeline_id", 1], ["name", "김예원"], ["msg", "ads"], ["created_at", 2016-12-21 23:29:17 UTC], ["updated_at", 2016-12-21 23:29:17 UTC]]
---
  def comment
    if user_signed_in?
      Comment.create(id_num: current_user.id , name: current_user.name, timeline_id: params[:timeline_id], msg: params[:msg])