app/controllers/users_controller.rb

  def create
    User.create(name: params[:name],
          email: params[:email],
          password: params[:password],
          password_confirmation: params[:password_confirmation],
          gender: params[:gender])
---
INSERT INTO "users" ("email", "name", "password_digest", "gender", "profile", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)